---
kind: method
id: M:Autodesk.Revit.DB.ViewNavigationToolSettings.GetHomeCamera
source: html/dadadb67-e2f8-f2f4-0346-742cea12452f.htm
---
# Autodesk.Revit.DB.ViewNavigationToolSettings.GetHomeCamera Method

Gets a copy of the structure containing information about the store Home view orientation.

## Syntax (C#)
```csharp
public HomeCamera GetHomeCamera()
```

## Returns
A copy of the structure containing information about the store Home view orientation, or
 Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no home view set for this document.